# 1. Берем легкий официальный образ Python
FROM python:3.11-slim

# 2. Создаем и переходим в рабочую папку внутри контейнера
WORKDIR /app

# 3. Копируем файл зависимостей в контейнер
COPY requirements.txt .

# 4. Устанавливаем зависимости (флаг --no-cache-dir экономит место)
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем весь остальной код (файл app.py) в контейнер
COPY app.py .

# 6. Говорим Docker, что приложение будет использовать порт 5000
EXPOSE 5000

# 7. Команда, которая запустится при старте контейнера
CMD ["python", "app.py"]